booking-service/loadtest/results/report.txt
     ✓ slots: status 200
     ✓ slots: p95 < 200ms

     █ create and cancel booking

       ✓ booking: created or conflict
       ✓ cancel: status 200

     checks.........................: 100.00% ✓ 13202      ✗ 0   
     data_received..................: 26 MB   395 kB/s
     data_sent......................: 3.0 MB  46 kB/s
   ✓ errors.........................: 0.00%   ✓ 0          ✗ 6601
     group_duration.................: avg=13.19ms  min=4.93ms   med=12.83ms  max=35.11ms p(90)=17.57ms  p(95)=19.13ms 
     http_req_blocked...............: avg=16.43µs  min=2.26µs   med=11.91µs  max=3.27ms  p(90)=16.92µs  p(95)=19.96µs 
     http_req_connecting............: avg=2.05µs   min=0s       med=0s       max=1.21ms  p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=4.63ms   min=637.68µs med=4.36ms   max=30.16ms p(90)=6.43ms   p(95)=7.4ms   
       { expected_response:true }...: avg=4.63ms   min=637.68µs med=4.36ms   max=30.16ms p(90)=6.43ms   p(95)=7.4ms   
   ✓ http_req_failed................: 0.00%   ✓ 0          ✗ 7805
     http_req_receiving.............: avg=199.79µs min=25.73µs  med=181.38µs max=7.76ms  p(90)=292.16µs p(95)=354.3µs 
     http_req_sending...............: avg=75.31µs  min=9µs      med=71.81µs  max=3.71ms  p(90)=110.41µs p(95)=138.34µs
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s      p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=4.36ms   min=416.5µs  med=4.09ms   max=30ms    p(90)=6.11ms   p(95)=7.03ms  
     http_reqs......................: 7805    120.027605/s
     iteration_duration.............: avg=6.05ms   min=1.66ms   med=4.85ms   max=39.37ms p(90)=8.53ms   p(95)=17.48ms 
     iterations.....................: 6601    101.512136/s
   ✓ slots_duration.................: avg=4.33ms   min=637.68µs med=4.23ms   max=24.91ms p(90)=5.74ms   p(95)=6.4ms   
     vus............................: 0       min=0        max=1 
     vus_max........................: 25      min=25       max=25